//
//  DataManager.swift
//  PathFinderCharacters
//
//  Created by Maksim Grischenko on 17.01.2023.
//

import Foundation

class DataManager {
    
    static let shared = DataManager()
    private init() {}
    
    let weaponNames = ["Боевой посох", "Дротик", "Дубинка", "Кинжал", "Копье", "Короткое копье", "Легкая булава", "Легкий арбалет", "Пилум", "Праща", "Тяжелая булава", "Тяжелый арбалет", "Удар без оружия", "Боевой молот", "Боевой топор", "Двуручный меч", "Двуручный топор", "Длинный лук", "Длинный меч", "Короткий лук", "Короткий меч", "Легкий молот", "Метательный топорик", "Нож-звезда", "Рапира", "Скимитар"]
    
    let weaponDistance = ["Ближний бой", "20 футов", "Ближний бой", "10 футов", "20 футов", "20 футов", "Ближний бой", "80 футов", "30 футов", "50 футов", "Ближний бой", "120 футов", "Ближний бой", "Ближний бой", "Ближний бой", "Ближний бой", "Ближний бой", "100 футов", "Ближний бой", "60 футов", "Ближний бой", "20 футов", "10 футов", "20 футов", "Ближний бой", "Ближний бой"]
    
    
    
}
