//
//  DataManager.swift
//  PathFinderCharacters
//
//  Created by Maksim Grischenko on 17.01.2023.
//

import Foundation

class DataManager {
    
    static let shared = DataManager()
    private init() {}
    
    let weaponsName = ["Боевой посох", "Дротик", "Дубинка", "Кинжал", "Копье",
                       "Короткое копье", "Легкая булава", "Легкий арбалет",
                       "Пилум", "Праща", "Тяжелая булава", "Тяжелый арбалет",
                       "Удар без оружия", "Боевой молот", "Боевой топор",
                       "Двуручный меч", "Двуручный топор", "Длинный лук",
                       "Длинный меч", "Короткий лук", "Короткий меч",
                       "Легкий молот", "Метательный топорик", "Нож-звезда",
                       "Рапира", "Скимитар"]
    
    let weaponsDistance = ["ближний бой", "20 футов", "ближний бой", "10 футов",
                          "20 футов", "20 футов", "ближний бой", "80 футов",
                          "30 футов", "50 футов", "ближний бой", "120 футов",
                          "ближний бой", "ближний бой", "ближний бой",
                          "ближний бой", "ближний бой", "100 футов",
                          "ближний бой", "60 футов", "ближний бой", "20 футов",
                          "10 футов", "20 футов", "ближний бой", "ближний бой"]
    
    let weaponsPrice = ["0 зм", "5 см", "0 зм", "2 зм", "2 зм", "1 зм", "5 зм",
                       "35 зм", "1 зм", "0 зм", "12 зм", "50 зм", "0 зм",
                       "12 зм", "10 зм", "50 зм", "20 зм", "75 зм", "15 зм",
                       "30 зм", "10 зм", "1 зм", "8 зм", "24 зм", "20 зм",
                       "15 зм"]
    
    let weaponsType = ["дробящее", "колющее", "дробящее", "колющее/режущее",
                       "колющее", "колющее", "дробящее", "колющее", "колющее",
                       "дробящее", "дробящее", "колющее", "дробящее","дробящее",
                       "режущее", "режущее", "режущее", "колющее", "режущее",
                       "колющее", "колющее", "дробящее", "режущее", "колющее",
                       "колющее", "режущее"]
    
    
    
    
    
}
